/**
 * 手机号码
 */
export const MOBILE_REGEXP =
  /^(13[0-9]|14[579]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9]|19[189])\d{8}$/
/**
 * 固定电话
 */
export const TELEPHONE_REGEXP = /^(([0+]\d{2,3}-)?(0\d{2,3})-)(\d{7,8})(-(\d{3,}))?$/
/**
 * 正整数
 */
export const POS_INT_REGEXP = /^[1-9]\d*$/
/**
 * 正实数
 */
export const POS_FLOAT_REGEXP = /^[1-9]\d*(\.\d+)?|0\.\d+$/
/**
 * 汉字
 */
export const CHINESE_REGEXP = /^[\u4e00-\u9fa5]{0,}$/
/**
 * 身份证
 */
export const ID_CARD_REGEXP =
  /^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/
/**
 * 护照
 */
export const PASSPORT_REGEXP =
  /^1[45][0-9]{7}$|(^[P|p|S|s]\d{7}$)|(^[S|s|G|g|E|e]\d{8}$)|(^[Gg|Tt|Ss|Ll|Qq|Dd|Aa|Ff]\d{8}$)|(^[H|h|M|m]\d{8,10}$)/
/**
 * IP
 */
export const IP_REGEXP =
  /((2(5[0-5]|[0-4]\d))|[0-1]?\d{1,2})(\.((2(5[0-5]|[0-4]\d))|[0-1]?\d{1,2})){3}/

/**
 * 车牌
 */
export const PLATE_NUMBER_REGEXP =
  /^([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[a-zA-Z](([DF]((?![IO])[a-zA-Z0-9](?![IO]))[0-9]{4})|([0-9]{5}[DF]))|[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1})$/

/**
 * 密码至少8位且包含数字字母特殊字符
 */
export const PASSWORD_REGEXP =
  /^(?=.*[A-Za-z])(?=.*\d)(?=.*[~`!@#$%^&*()_\-+={}[\]|\\:;"'<>,.?/])[A-Za-z\d~`!@#$%^&*()_\-+={}[\]|\\:;"'<>,.?/]{8,}$/

/**
 * ip:port正则校验
 */
export const IP_PORT_REGEXP =
  /^(\d|[1-9]\d|1\d{2}|2[0-4]\d|25[0-5])\.(\d|[1-9]\d|1\d{2}|2[0-4]\d|25[0-5])\.(\d|[1-9]\d|1\d{2}|2[0-4]\d|25[0-5])\.(\d|[1-9]\d|1\d{2}|2[0-4]\d|25[0-5]):([0-9]|[1-9]\d|[1-9]\d{2}|[1-9]\d{3}|[1-5]\d{4}|6[0-4]\d{3}|65[0-4]\d{2}|655[0-2]\d|6553[0-5])$/
