<template>
  <view class="pay-protocol">
    <div class="title">会员支付协议</div>
    <div class="content">
      {{
        `
    尊敬的用户，为保障您的合法权益，请您在充值前仔细阅读本规则，以免造成误解。当您点击立即充值按钮后，即视为您已阅读、理解本协议，并同意按本协议的规定参与充值。
    1、本协议相关定义
    1.1耀美咖啡现磨咖啡：指北京玖盛圆科技有限公司经营的移动自助现磨咖啡机所售卖的耀美咖啡现磨咖啡饮品，耀美咖啡支持线下饮品购买。
    1.2用户：是指购买耀美咖啡现磨咖啡任意饮品的用户，在本协议中更多地称为“您”。 2、特别说明
    2.1余额构成：充值本金（您充值时实际支付的金额）加上耀美咖啡的赠送金额（含优惠活动赠送的金额、支付时使用的优惠券金额等），构成您的账户余额（人民币）。
    2.2余额有效期：充值本金及赠送金额有效期由充值日起至使用完毕为止。
    2.3余额使用：账户余额可用于购买支付耀美咖啡饮品，但不能转赠。使用余额支付时优先使用本金。
    2.5正当性保证：我们包含充值赠送在内的所有优惠推广活动仅面向正当合法购买和使用咖啡机及微信平台的用户。一旦您存在利用我们的规则漏洞进行任何形式的作弊行为（包括但不限于通过我们的活动获得不正当的经济利益），我们有权取消与作弊行为相关账户赠送金额、追回您作弊所得的不正当经济利益、关闭作弊账户或与您相关的所有账户，并保留取消您后续使用我们服务的权利，及依据严重程度追究您的法律责任。
    2.6未成年人保护：若您是18周岁以下的未成年人，在使用本充值服务前，应事先取得您监
    护人的书面同意。依据我国相关法律对于未成
    年人民事行为效力的规定，为保护未成年人在使用本充值服务的权益，未成年人在进行耀美咖啡充值及消费等行为前，应事先取得您监护人的书面同意。若完成充值行为后，且未成年人和（或）其监护人主张该充值行为无效的，耀美咖啡支持退还相应充值本金金额，用户不得因此要求作任何补偿或赔偿。
    2.7
    通知和送达：本协议项下所有的通知均可通过重要页面公告、电子邮件、短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。
    2.8特别说明：目前仅支持微信端的充值和消费，若发生退款，其金额将退回您由微信支付的原账户。`
      }}
    </div>
  </view>
</template>

<script setup lang="ts"></script>

<style lang="scss">
.pay-protocol {
  width: 100%;
  white-space: pre-wrap;

  .title {
    width: 100%;
    text-align: center;
  }
  .content {
    white-space: pre-wrap;
  }
}
</style>
