/**
 * 白绿1蓝2紫3橙4粉5红6
 * 
 * 
头部（头盔）： 保护角色头部，提供额外的防御或特殊效果。
    闪避
颈部（项链）： 装备在角色的颈部，通常提供一些特殊属性或增加属性值。
    特殊 - 魔法珠 每升一颜色+1槽位，每种主属性珠子最多镶一颗
护肩（披风）
    暴击
胸部（铠甲）： 保护角色的胸部，提供主要的防御能力。
    防御 
护手
    攻击
腿部（裤子）： 保护角色的腿部，提供额外的防护。
    生命
足部（靴子）： 装备在脚部，可能提供移动速度或其他特殊效果。
    速度 
手持武器（武器）： 角色的主要攻击装备，用于近战或远程攻击。
    主穿透


白 
合成 - 白色装备原石*10 初始0品质分
    属性 主+50战力  副+10战力
品级 - 下品 普通 精良 上品 优秀 极品 完美 0-700分
    分别增加基础属性0/5/15/30/50/75/100
    每100分需要的淬炼分+1
    淬炼石 - 淬炼分下品1~10普通5~20上品10~50极品40~100完美100
升级 - 同级装备原石*10 + 白色矿石最多10颗
    白色矿石 - 下品+3%普通+5%优秀7%稀有+10%极品15%完美20%
    失败损失全部矿石和一半原石
    升级成功主+50战力  副+10战力
附魔 - 附魔石，分不同属性，每次附魔需要1-10颗
    - 每级分别增加1点属性（50战力）
    - 概率1-10 10% 10+(5%成功2%倒退1级)

绿
合成 - 极品10级白色装备+绿色装备原石*10 - 初始0-200品质分
    成功率90%（每一阶都-10），失败原石消失
    成功后附魔清0，所有属性相加成为原始属性
    基础属性主+200战力  副+40战力
    升级成功主+200战力 副+40战力
    附魔- 每级分别增加1-5点属性（中心值会+1范围+2）

    装备白色1件10级 近600 * 2 + 500 = 1700战 * 6

魔法珠 - 魔法碎片 * 10 
每种属性一个，最多7颗，初始普通0
分白到红7阶，上限白5绿10... 属性白+1绿+2...
升星 - 魔法碎片 * 5 + 5 * 星数 + 白色魔法结晶最多10颗 
    白色魔法结晶 - 下品+3%普通+5%优秀7%稀有+10%极品15%完美20%
    失败损失全部结晶和一半碎片
精神之光，提升品阶 - 不同品阶上限不同 - 每提升一星解锁20% 0-400分
    - 下品1~10普通5~20上品10~50极品40~100完美100
    每100分需要的精神分+2,初始普通0，,200-400-600-800
    普通20%、清亮40%、透明60%、纯净0%、无暇100%（上限）


 */
