/**
 *
 * 属性
 * 力量 - 提升攻击力和防御
 * 敏捷 - 提升速度和闪避
 * 智力 - 提升命中闪避
 * 体力 - 提升生命和防御
 * 技力 - 提升
 * 意志 - 减轻低生命惩罚，
 *                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    -
 * 
头部（头盔）： 保护角色头部，提供额外的防御或特殊效果。
颈部（项链）： 装备在角色的颈部，通常提供一些特殊属性或增加属性值。
胸部（铠甲）： 保护角色的胸部，提供主要的防御能力。
腿部（裤子）： 保护角色的腿部，提供额外的防护。
足部（靴子）： 装备在脚部，可能提供移动速度或其他特殊效果。
手持武器（武器）： 角色的主要攻击装备，用于近战或远程攻击。
 *
 * 生命值
 * 攻击力
 * 防御力 
 * 体力恢复
 * 速度 - 攻击速度 双方速度相除，就是每秒攻击次数
 * 暴击 - 双方暴击相除，就是伤害倍数
 * 闪避 - 双方闪避相除，大于1的那个获得1 - 1/倍数的闪避率
 * 格挡 - 格挡即将收到的伤害
 * 穿透 - 无视穿透数值的防御
 */
