/**
 * 装备
 * 只有最高品质最高等级的低阶装备才能进阶成高阶装备
 *
 * 装备原石 - 打造装备和突破装备品质
 * 古战场获取 - 分白-红7级，7个部位
 * 淬炼石 - 提升装备品质分数
 * 古战场获取 - 分白-红7级，和不同品级
 *
 * 矿石 - 提升装备等级
 * 矿脉获取 - 分白-红7级，不同品种，不同部位装备需要数量不一
 * 矿晶 - 提升突破装备等级概率
 * 矿脉获取 - 分白-红7级
 * 附魔石 - 附加额外属性，装备重铸进阶成功后附加属性会成为基础数据
 *  注意，高等级附魔可能会导致失败甚至倒退
 * 矿脉获取 - 分白-红7级，和9种不同主属性
 * 洗练石 - 洗练某一级的附魔属性，可能变好或者变坏
 * 矿脉获取 - 分白-红7级
 *
 * 魔法碎片 - 合成魔法珠和提升等级的基本材料
 * 魔法禁地获取
 * 精神之光 - 提升魔法珠品阶必须
 * 魔法禁地获取 - 分白-红7级
 * 魔法结晶 - 提升魔法珠等级必须
 * 魔法禁地获取
 *
 * 等级星级
 * 经验药水
 * 突破丹（不同的叫法不同）与辅助丹 - 突破等级
 * 境界石 - 提升境界
 * 1-6星，每一境界分别有1-5个小境界
 * 突破石 - 突破境界
 *
 * 货币
 * 银两 - 现实的钱
 * 竞技排名币 - 地位收益
 * 探险币 - 勇气收益、信息收益
 * 抽奖币 - 阶段奖励等、运气收益
 * 练功凭证 - 练功房币，时间奖励
 * 魔法结晶 - 魔法岛币
 *
 * 其它
 * 体力 - 刷本
 * 失败凝珠 - 抽奖
 *
 */
