/**
 * 大陆守护计划
 *
 * 每周必须参加一次
 * 评级7段每段1-100星
 * 对应原始联盟 - 亚大陆联盟 - 古中国 - 省 - 城 - 县 - 村7个级别
 * 基数为1000
 * 每阶每星战力+300/400/500/600/700/800/900
 * 每阶晋级战力+3000/5000/7000...13000
 * 进入时战力需要减去衰老值(每日+10衰老)
 * 3次挑战机会，取最高成功的排名
 *
 * 每10星少量增加奖励
 * 每阶大量增加奖励
 * 奖励
 * - 金钱、抽奖币、阶级勋章、每日俸禄（包括金钱、凭证等）
 */

/**
 * 古战场
 * 遗落大量装备原石的地方，越深入原石等级品质越高
 * 战场由国家或者联盟管控，每天1次，除非使用特定道具
 * 每次只能去一种品阶的战场，如绿品阶最高只能得的绿色原石
 * 如果死亡什么都得不到
 * 每个战场分10层，每一层奖励基于上一层增加25%，战力增加30%-60%
 * 白色战场第一层战力300
 *
 */
/**
 * 远古矿石山脉
 * 遗落大量矿石的地方，越深入矿石等级品质越高
 * 战场由国家或者联盟管控，每天1次，除非使用特定道具
 * 如果死亡什么都得不到
 *
 * 每个战场分10层，每一层奖励基于上一层增加25%，战力增加30%-60%
 * 白色山脉第一层战力300
 */
/**
 * 魔法禁地
 * 遗落大量魔法珠的地方，越深入魔法珠等级品质越高
 * 受精神力量的限制，每人每天最多进入一次，除非使用特定道具
 *
 * 禁地每一层奖励基于上一层增加25%，战力增加20%-80%，无限层数
 * 第一层战力300
 * 奖励各类魔法碎片，魔法结晶
 */
/**
 * 记忆之地 - 主线
 * 个人和法则融合的世界，剧情，阶段奖励和刷体力重复奖励
 * 从自身法则中汲取力量
 * 需要现实世界提供的体力
 * 一章完成才能进行下一章，每一章都有奖励
 * 获取内在修炼的灵魂石
 */

/**
 * 练功房
 * 花费时间提升少量修为的地方
 * 不同阶级不同环境不同时间练功房效果也不一样
 * 每人每天1次
 * 共7阶
 * 奖励波动较大
 */
