/**
 * 总目标
 *
 * 让自己未来更好
 * 让自己知道要做什么
 * 让自己立即品尝到努力的甜头
 * 摆脱现在矛盾的自己
 *
 * 如何实现目标
 * 强行让自己以该计划为核心
 * 抵御眼前的诱惑
 * 在不断的迭代修正升级中前行
 *
 * 具体怎么做
 * 包容当前的生活模式
 * 提供修正当前生活、计划不满意地方的能
 * 以这个现实或者说自己在现实中的体验为主
 *
 * 如何设计这样的系统
 * - 包含当前生活模式
 *  - 前端工作、生信、健康、生活整洁、游戏
 * - 我想要但还没有的生活模式
 *  - 生活简单而干净、未来有未来
 *  兑换RMB实际为抽奖，价值为10，实际为5-100
 *
 * - 投入时间和精力 - 时间凝珠 20分钟 = 1 = 10RMB
 * - 控制环境 - 空间凝珠
 *      每天对各个环境扫描评估，给出品级和改进意见
 *      所有评级为优秀+20，合格+10，不合格+5，改进意见+评级 = 优秀
 *
 * - 控制自己，健康生活 - 勇气凝珠
 * - 进入不熟悉但重要的领域、做提升效率或者积累非金钱资产的事  - 智慧凝珠
 *
 *
 * - 通过副业赚钱 - 因果凝珠 赚10 = 1 = 10RMB
 * - 记录发现问题，修正迭代，奖励目标计划 - 飞升凝珠
 *
 * 上限30 1 = 3RMB
 * 时间凝珠 时间+精力 20分钟 = 1
 * 空间凝珠 环境审查+修正+维持
 * 智慧凝珠 进入不熟悉但重要的领域、做提升效率或者积累非金钱资产的事
 * 勇气凝珠 自律、健康锻炼、果断决绝
 * 飞升凝珠 对计划整体和细节的不断迭代、监控、修改、验证循环
 * 因果凝珠 努力结成果，所有副业赚的钱都是果实
 * 
 * 空间 - 分别评价工作、租房、家里、汽车、穿搭等环境，
 * 时间

每日最多10小时的投入
空间

完成环境评估表 
定制今日环境提升计划表 
根据评估表当前评级直接获得对应凝珠 最高30
根据计划表完成 +1-30
根据今日情况优化修改评估表和计划表 

勇气
完全了解勇气评估表的触发场景和任务列表
完成任务列表任务+20
触发场景选择正确+10-20
任务和场景最多+30
根据今日情况优化修改勇气评估表

智慧
花时间和精力在有意义的事情上，并有一定的成果
过程和结果各1半

因果

飞升
完成环境评估表 +2
定制今日环境提升计划表 +2
完全了解并微调勇气评估表的触发场景和任务列表+2
修正智慧纲要
定制今日智慧计划具体内容+2

记录各个计划执行时遇到的问题 + 2
思考本计划有什么缺陷，各个凝珠难易平衡程度并且及时调整环境、勇气、智慧评估和计划表格 + 5
监督计划的执行和记录执行阻力，想办法去除阻力
 */
