/**
 * 
- 世界由未知的力量创建的，每个人都被限制

衰老

时间、不良作息会增加衰老
健康作息会轻微减少衰老
衰老不可逆，并会影响各个属性，包括潜力

法则

28法则，头尾都是稀缺的，大部分都在中间

- 世界宗门林立，看似宗门会给本派提供支持，实际这个世界的法则就是会汲取弱势群体的时间，为高层服务

阶级（境界）

阶级越低，越可能被抽取时间，同时时间越少越难提升阶级
可以视为修为境界有寿命，在一定时间内不突破，就会死亡

- 觉醒，过去一直活在环境中没有自我，这算是对世界压迫的反抗，不管现在是好是坏，都算成功到了这一步

初始资金 - 之前花的游戏币等






原始大陆2024纪元

这是一片突破世界法则初级屏蔽的人进入的另一个平行世界
是真实世界存在弱映射，它有自己的一套法则
这里部落宗族国家林立，暂时处于和平状态
而这和平是因为各国宗派联合建立的世界联通的晋升考核体系 - 大陆守护计划
    名义上为了抵御法则之力产生的魔物而挑选人才
    实际是为了名正言顺的剥削底层人民
    魔物和人本身都是法则创造的生物，相互无法磨灭
    高层可以兵不血刃长享荣华富贵
    具体就是每人必须每周一次进入试炼场考核，根据名次获取称号
    不同称号给予不同的地位和奖励，没有称号的普通人还需要额外付出税收以支持这些维护和平的“英雄”
炼体炼物等都能吸收法则增强自己，因为我们自身就源于法则，也受制于法则
法则对个人的独立性限制修行只能个人进行
法则之力会对每个人持续增加衰老值buff,不可逆，会减弱个人战力
国家、宗族等单位从大到小分为
原始联盟 - 亚大陆联盟 - 古中国 - 省 - 城 - 县 - 村
低战力的人需要向高战力的人贡献时间
而高战力的人不但不需要花时间在杂事上，还可以通过规则免费获取资源
修行变强是普通人唯一的途径
排名按战力，即各项能力综合评分进行

需要平行世界的自己完成任务获取体力、货币等这个世界需要的东西
然后去各个矿石山脉、古战场、魔法禁地、法则世界等地方和魔物战斗，获取资源
修行也是一种夺天地造化，不断吸取混乱度的过程


 */
