<template>
  <view class="coffee-protocol">
    <div class="title">《耀美咖啡用户协议》</div>
    <div class="content">
      {{
        `
          【提示条款】欢迎您与各耀美咖啡平台经营者（详见定义条款）共同签署本《耀美咖啡用户服务协议》（下称“本协议”）并使用耀美咖啡平台服务！自本协议发布之日起，耀美咖啡平台各处所称“耀美咖啡用户服务协议”均指本协议。各服务条款前所列索引关键词仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述。
    【审慎阅读】您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以下划线标识，您应重点阅读。如您对协议有任何疑问，可向耀美咖啡平台咨询。
    【签约动作】当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与耀美咖啡达成一致，成为耀美咖啡平台“用户”，接受并不得违反本协议的所有约定。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。一、定义
    耀美咖啡平台：指耀美咖啡网站、客户端APP、微商城、小程序及自有或合作门店组成的有机整体。
    耀美咖啡：耀美咖啡平台各经营者的合称，包括耀美咖啡平台的经营主体、合作商家主体与市场推广主体等。耀美咖啡平台服务：耀美咖啡基于互联网，以包含耀美咖啡平台网站、客户端APP、微商城、小程序及自有或合作门店等在内的各种形态（包括未来技术发展出现的新的服务形态）向您提供的各项服务。
    关联公司：除耀美咖啡平台的经营主体以外所有参与经营主体的合称。
    同一用户：使用同一身份认证信息或经耀美咖啡排查认定多个耀美咖啡账户的实际控制人为同一人的，均视为同一个用户，简称“同一用户”。
    二、协议范围 2.1签约主体
    【平等主体】本协议由您与耀美咖啡平台经营者共同缔结，本协议对您与耀美咖啡平台经营者均具有合同效力。
    【主体信息】耀美咖啡平台经营者是指经营耀美咖啡平台的各法律主体，您可在耀美咖啡平台中查看公示的证照信息以确定与您履约的耀美咖啡主体。本协议项下，耀美咖啡平台经营者可能根据耀美咖啡平台的业务调整而发生变更，变更后的耀美咖啡平台经营者与您共同履行本协议并向您提供服务，耀美咖啡平台经营者的变更不会影响您本协议项下的权益。耀美咖啡平台经营者还有可能因为提供新的耀美咖啡平台服务而新增，如您使
    用新增的耀美咖啡平台服务的，视为您同意新增的耀美咖啡平台经营者与您共同履行本协议。发生争议时，您可根据您具体使用的服务及对您权益产生影响的具体行为对象确定与您履约的主体及争议相对方。
    2.2补充协议
    由于互联网高速发展，您与耀美咖啡签署的本协议列明的条款并不能完整罗列并覆盖您与耀美咖啡所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，耀美咖啡平台法律声明及隐私权政策为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用耀美咖啡平台服务，视为您同意上述补充协议。
    三、账户注册与使用 3.1用户资格
    您确认，在您开始注册程序使用耀美咖啡平台服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。
    3.2账户说明
    【账户获得】当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得耀美咖啡平台账户并成为耀美咖啡平台用户。
    【账户使用】您有权使用您设置或确认的耀美咖啡会员名、手机号码、开放平台账号（以下简称“账户名称”）及您设置的密码（账户名称及密码合称“账户”）登录耀美咖啡平台。
    【实名认证】作为耀美咖啡平台经营者，法律并未赋予耀美咖啡强制要求所有用户进行实名认证的权力，但为使您更好地使用耀美咖啡平台的各项服务，耀美咖啡建议您按照耀美咖啡公司要求及我国法律规定完成实名认证。
    3.3 注册信息管理3.3.1真实合法
    【信息真实】在使用耀美咖啡平台服务时，您应当按耀美咖啡平台页面的提示准确完整地提供您的信息（包括您的姓名及电子邮件地址、联系电话、联系地址等），以便耀美咖啡与您联系。您了解并同意，您有义务保持您提供信息的真实性及有效性。
    【用户名的合法性】您设置的耀美咖啡用户名不得违反国家法律法规及耀美咖啡关于用户名的管理规定，否则耀美咖啡可拒绝您设置的用户名。
    3.3.2更新维护
    您应当及时更新您提供的信息，在法律有明确规定要求耀美咖啡作为平台服务提供者必须对部分用户（如平台卖家等）的信息进行核实的情况下，耀美咖啡将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整的信息。如耀美咖啡按您最后一次提供的信息与您联系未果、您未按耀美咖啡的要求及时提供信息、您提供的信息存在不实的，您将承担因此对您自身、他人及耀美咖啡造成的全部损失与不利后果。3.4账户安全规范
    【账户安全保管义务】您的账户为您自行设置并由您保管，耀美咖啡任何时候均不会主动要求您提供您的账户。因此，建议您务必保管好您的账户，并确保您在每
    个上网时段结束时退出登录并以正确步骤离开耀美咖啡平台。
    账户因您主动泄露或遭受他人攻击、诈骗等行为导致的损失及后果，均由您自行承担。
    【账户行为责任自负】除耀美咖啡存在过错外，您应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、购买商品及服务及披露信息等）负责。
    【日常维护须知】如发现任何未经授权使用您账户登录耀美咖啡平台或其他可能导致您账户遭窃、遗失的情况，建议您立即通知耀美咖啡。
    您理解耀美咖啡对您的任何请求采取行动均需要合理时间，除耀美咖啡存在过错外，耀美咖啡对在采取行动前已经产生的后果不承担任何责任。
    四、用户信息的保护及授权4.1个人信息的保护
    耀美咖啡非常重视用户个人信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护，在您使用耀美咖啡提供的服务时，您同意耀美咖啡按照在耀美咖啡平台上公布的隐私权政策收集、存储、使用、披露和保护您的个人信息，包括但不限于向第三方风控公司提供相关数据，为此耀美咖啡与第三方风控公司均会保护您的个人信息。耀美咖啡希望通过隐私权政策向您清楚地介绍耀美咖啡对您个人信息的处理方式，因此耀美咖啡建议您完整地阅读隐私权政策，以帮助您更好地保护您的隐私权。
    4.2耀美咖啡会对您的账号进行风控识别，包括但不限于从代理监测，人机识别，地理定位识别，作弊工具识别，虚拟号，消耗识别和地址雷达识别等。若您的账号在注册，登陆，下单或支付时被监测发现异常，将会影响您的正常使用，耀美咖啡有权将您异常订单进行拦截，如此行为造成耀美咖啡及／或其关联公司损失，有义务向耀美咖啡及／或其关联公司进行赔偿。
    4.3非个人信息的保证与授权
    【信息的发布】您声明并保证，您对您所发布的信息拥有相应、合法的权利。否则，耀美咖啡可对您发布的信息依法或依本协议进行删除或屏蔽。
    【禁止性信息】您应当确保您所发布的信息不包含以下内容： （一）违反国家法律法规禁止性规定的；
    （二）政治宣传、封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；
    （三）欺诈、虚假、不准确或存在误导性的；
    （四）侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；
    （五）侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的；
    （六）存在可能破坏、篡改、删除、影响耀美咖啡平台任何系统正常运行或未经授权秘密获取耀美咖啡平台及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；
    （七）其他违背社会公共利益或道德或依据相关耀美咖啡平台协议、规则的规定不适合在耀美咖啡平台上发布的。
    【授权使用】对于您提供及发布除个人信息外的文字、图片、视频、音频等非个人信息，在版权保护期内您免
    费授予耀美咖啡及其关联公司获得全球排他的许可使用权利及再授权给其他第三方使用的权利。您同意耀美咖啡及其关联公司存储、使用、复制、修订、编辑、发布、展示、翻译、分发您的非个人信息或制作其派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。为方便您使用耀美咖啡平台其他相关服务，您授权耀美咖啡将您在账户注册和使用耀美咖啡平台服务过程中提供、形成的信息运行在耀美咖啡平台选择的云平台上，或脱敏传递必要的信息给三方支付服务、物流服务等其他相关服务提供者，或从其他相关服务提供者获取您在注册、使用相关服务期间提供、形成的信息。
    五、用户的违约及处理5.1违约认定 发生如下情形之一的，视为您违约：
    （一）使用耀美咖啡平台服务时违反有关法律法规规定的；
    （二）违反本协议或本协议补充协议（即本协议第2.2条）约定的。
    为适应电子商务发展和满足海量用户对高效优质服务的需求，您理解并同意，耀美咖啡可在耀美咖啡平台规则中约定违约认定的程序和标准。如：耀美咖啡可依据您的用户数据与海量用户数据的关系来认定您是否构成违约；您有义务对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。
    5.2违约处理措施
    【信息处理】您在耀美咖啡平台上发布的信息构成违约的，耀美咖啡可根据相应法律规定和耀美咖啡平台规则立即对相应信息进行删除或屏蔽处理。
    【行为限制】您在耀美咖啡平台上实施的行为，或虽未在耀美咖啡平台上实施但对耀美咖啡平台及其用户产生影响的行为构成违约的，耀美咖啡可依据相应规则对您执行账户扣分、限制参加营销活动、中止向您提供部分或全部服务、划扣违约金等处理措施。如您的行为构成根本违约的，耀美咖啡可查封您的账户，终止向您提供服务。
    【支付账户处理】当您违约的同时存在欺诈、售假、盗用他人账户等特定情形或您存在危及他人交易安全或账户安全风险时，耀美咖啡会依照您行为的风险程度指示对您的支付账户采取取消收款、资金止付等强制措施。【处理结果公示】耀美咖啡可将对您上述违约行为处理措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在耀美咖啡平台上予以公示。
    5.3赔偿责任
    如您的行为使耀美咖啡及／或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿耀美咖啡及／或其关联公司的上述全部损失。
    如您的行为使耀美咖啡及／或其关联公司遭受第三人主张权利，耀美咖啡及／或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。
    如因您的行为使得第三人遭受损失或您怠于履行协调处理决定、耀美咖啡及／或其关联公司出于社会公共利益保护或消费者权益保护目的，可指示公司自您的支付账户中划扣相应款项进行支付。
    如您的支付余额或保证金不足以支付相应款项的，您同意耀美咖啡指示公司自您的支付账户中划扣相应款项支付上述赔偿款项。
    如您支付账户中的款项不足以支付上述赔偿款项的，耀美咖啡及／或关联公司可直接抵减您在耀美咖啡及／或其关联公司其它协议项下的权益，并可继续追偿。
    5.4特别约定
    【商业贿赂】如您向耀美咖啡及／或其关联公司的雇员或顾问等提供实物、现金、现金等价物、劳务、旅游等价值明显超出正常商务洽谈范畴的利益，则可视为您存在商业贿赂行为。发生上述情形的，耀美咖啡可立即终止与您的所有合作并向您收取违约金及／或赔偿金，该等金额以耀美咖啡因您的贿赂行为而遭受的经济损失和商誉损失作为计算依据。
    【关联处理】如您因严重违约导致耀美咖啡终止本协议时，出于维护平台秩序及保护消费者权益的目的，耀美咖啡及／或其关联公司可对与您在其他协议项下的合作采取中止甚或终止协议的措施，并以本协议第八条约定的方式通知您。
    如耀美咖啡与您签署的其他协议及耀美咖啡及／或其关联公司与您签署的协议中明确约定了对您在本协议项下合作进行关联处理的情形，则耀美咖啡出于维护平台秩序及保护消费者权益的目的，可在收到指令时中止甚或终止协议，并以本协议第八条约定的方式通知您。
    六、协议的变更
    耀美咖啡可根据国家法律法规变化及维护交易秩序、保护消费者权益需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过法定程序并以本协议第八条约定的方式通知您。
    如您不同意变更事项，您有权于变更事项确定的生效日前联系耀美咖啡反馈意见。如反馈意见得以采纳，耀美咖啡将酌情调整变更事项。
    如您对已生效的变更事项仍不同意的，您应当于变更事项确定的生效之日起停止使用耀美咖啡平台服务，变更事项对您不产生效力；如您在变更事项生效后仍继续使用耀美咖啡平台服务，则视为您同意已生效的变更事项。
    七、通知 您同意耀美咖啡以以下合理的方式向您送达各类通知：（一）在耀美咖啡平台主页公示的文案；
    （二）站内信、站内弹窗、客户在线通知、客户端推送的消息等；
    （三）根据您预留于耀美咖啡平台的联系方式发出的电子邮件、短信、函件等。 八、协议的终止
    8.1终止的情形 【用户发起的终止】您有权通过以下任一方式终止本协议：
    （一）变更事项生效前您停止使用并明示不愿接受变更事项的；
    （二）您明示不愿继续使用耀美咖啡平台服务，且符合耀美咖啡终止条件的。
    【耀美咖啡发起的终止】出现以下情况时，耀美咖啡可以本协议第八条的所列的方式通知您终止本协议：
    （一）您违反本协议约定，耀美咖啡依据违约条款终止本协议的；
    （二）您盗用他人账户、发布违禁信息、骗取他人财物、售假、扰乱市场秩序、采取不正当手段谋利等行为，耀美咖啡依据耀美咖啡平台规则对您的账户予以查封的；
    （三）除上述情形外，因您二次以上违反耀美咖啡平台规则相关规定且情节严重，耀美咖啡依据耀美咖啡平台规则对您的账户予以查封的；
    （四）您在耀美咖啡或其他平台有欺诈、侵犯他人合法权益或其他严重违法违约行为的；
    （五）其它应当终止服务的情况。8.2协议终止后的处理
    【用户信息披露】本协议终止后，除法律有明确规定外，耀美咖啡无义务向您或您指定的第三方披露您账户中的任何信息。
      `
      }}
    </div>
  </view>
</template>

<script setup lang="ts"></script>

<style lang="scss">
.coffee-protocol {
  width: 100%;
  white-space: pre-wrap;

  .title {
    width: 100%;
    text-align: center;
  }
  .content {
    white-space: pre-wrap;
  }
}
</style>
