<template>
  <view class="privacy-protocol">
    <div class="title">《隐私权政策》</div>
    <div class="content">
      {{
        `
【特别提示】请仔细阅读《耀美咖啡隐私权政策》（尤 其是加粗划线的内容）并确定了解我们对您个人信息的 处理规则。阅读过程中，如您有任何疑问，可联系我们 的客服咨询，如您不同意协议中的任何条款，您应立即 停止访问耀美咖啡。阅读协议的过程中，如果您不同意 相关协议或其中任何条款约定，您应立即停止使用耀美咖啡。
引言
耀美咖啡（“我们”）非常重视用户的隐私和个人信息保 护。您在使用我们的产品与／或服务时，我们可能会收 集和使用您的相关信息。我们希望通过《耀美咖啡隐私 权政策》（“本隐私权政策”）向您说明我们在您使用我 们的产品与／或服务时如何收集、使用、保存、共享和 转让这些信息，以及我们为您提供的访问、更新、删除 和保护这些信息的方式。
耀美咖啡（“我们”）非常重视用户的隐私和个人信息保 护。您在使用我们的产品与／或服务时，我们可能会收 集和使用您的相关信息。我们希望通过《耀美咖啡隐私 权政策》（“本隐私权政策”）向您说明我们在您使用我 们的产品与／或服务时如何收集、使用、保存、共享和 转让这些信息，以及我们为您提供的访问、更新、删除 和保护这些信息的方式。
本隐私权政策将帮助您了解以下内容： 一、我们如何收集和使用您的个人信息 二、我们如何使用Cookies和同类技术
三、我们如何共享、转让、公开披露您的个人信息 四、我们如何保护和保存您的个人信息
五、您如何管理个人信息 六、未成年人的个人信息保护 七、通知和修订
八、如何联系我们
本隐私权政策与您所使用的耀美咖啡商城及平台服务以 及该服务所包括的各种业务功能（以下统称“我们的产 品与／或服务”）息息相关，希望您在使用我们的产品 与／或服务前仔细阅读并确认您已经充分理解本隐私权 政策所写明的内容，并让您可以按照本隐私权政策的指 引做出您认为适当的选择。本隐私权政策中涉及的相关 术语，我们尽量以简明扼要的表述，以便您更好地理 解。您使用或在我们更新本隐私权政策后（我们会及时 提示您更新的情况）继续使用我们的产品与／或服务， 即意味着您同意本隐私权政策（含更新版本）内容，并且 同意我们按照本隐私权政策收集、使用、保存和共享您 的相关信息。
如对本隐私权政策或相关事宜有任何问题，您可随时通 过客服联系我们。
一、我们如何收集和使用您的个人信息
个人信息是指以电子或者其他方式记录的能够单独或者 与其他信息结合识别特定自然人身份或者反映特定自然 人活动情况的各种信息。本隐私权政策中涉及的个人信
息包括：基本信息（包括个人姓名、生日、性别、住
址、个人电话号码、电子邮箱）；个人身份信息（包括 身份证、军官证、护照、驾驶证等）；面部特征；网络 身份标识信息（包括系统账号、IP地址、邮箱地址及与 前述有关的密码、口令、口令保护答案）；个人财产信 息（交易和消费记录、以及余额、积分、优惠券、等虚 拟财产信息）；通讯录；个人上网记录（包括网站浏览 记录、软件使用记录、点击记录）；个人常用设备信息 （包括硬件型号、设备MAC地址、操作系统类型、软 件列表唯一设备识别码（如IMEI／android
ID／IDFA／OPENUDID／GUID、SIM卡IMSI信息等在内的 描述个人常用设备基本情况的信息）；个人位置信息 （包括行程信息、精准定位信息、经纬度等）；
个人敏感信息是指一旦泄露、非法提供或滥用可能危害 人身和财产安全，极易导致个人名誉、身心健康受到损 害或歧视性待遇等的个人信息，本隐私权政策中涉及的 个人敏感信息包括：您的财产信息（包括交易记录及耀美咖啡账户余额、积分、优惠券等虚拟财产信息）；面 部识别特征；个人身份信息（包括身份证、军官证、护 照、驾驶证、户口本）；网络身份识别信息（包括账 号、邮箱地址及与前述有关的密码口令的组合）；其他 信息（包括通讯录、行程信息、网页浏览记录、精准定 位信息）。
我们仅会出于以下目的，收集和使用您的个人信息： （一）您须授权我们收集和使用您个人信息的情形 我们的产品与／或服务包括一些核心功能，这些功能包 含了实现网上购物所必须的功能及保障交易安全所必须 的功能。我们可能会收集、保存和使用下列与您有关的 信息才能实现上述这些功能。如果您不提供相关信息， 您将无法享受我们提供的产品与／或服务。这些功能包 括：
1、实现网上购物所必须的功能 （1）用户注册
您首先需要注册一个耀美咖啡账户成为耀美咖啡用户。 当您注册时，您需要至少向我们提供您准备使用的耀美咖啡账户名、密码、您本人的手机号码，我们将通过发 送短信验证码来验证您的身份是否有效。您的账户名为 您的默认昵称，您可以修改补充您的昵称、性别、生日 以及您的实名认证相关信息，这些信息均属于您的“账 户信息”。您补充的账户信息将有助于我们为您提供个 性化的商品推荐和更优的购物体验，但如果您不提供这 些补充信息，不会影响您网上购物的基本功能。
（2）商品信息展示和搜索
为了让您快速地找到您所需要的商品，我们可能会收集 您使用我们的产品与／或服务的设备信息（包括设备名 称、设备型号、设备识别码、操作系统和应用程序版 本、语言设置、分辨率、服务提供商网络ID
（PLMN））、浏览器类型来为您提供商品信息展示的 最优方式。我们也会为了不断改进和优化上述的功能来 使用您的上述个人信息。
您也可以通过搜索来精准地找到您所需要的商品或服 务。我们会保留您的搜索内容以方便您重复输入或为您 展示与您搜索内容相关联的商品。请您注意，您的搜 索关键词信息无法单独识别您的身份，不属于您的个人 信息，我们有权以任何的目的对其进行使用；只有当您 的搜索关键词信息与您的其他信息相互结合使用并可以
识别您的身份时，则在结合使用期间，我们会将您的搜 索关键词信息作为您的个人信息，与您的搜索历史记录 一同按照本隐私政策对其进行处理与保护。
为了将您感兴趣的商品或服务信息展示给您，或在您搜 索时向您展示您可能希望找到的商品，我们可能会收集 您的订单信息、浏览信息进行数据分析以形成用户画 像。我们还可能为了提供服务及改进服务质量的合理需 要而获得的您的其他信息，包括您与客服联系时您提供 的相关信息，您参与问卷调查时向我们发送的问卷答复 信息，以及您与我们的关联方、我们合作伙伴之间互动 时我们获得的相关信息。对于从您的各种设备上收集到 的信息，我们可能会将它们进行关联，以便我们能在这 些设备上为您提供一致的服务。我们可能会将来自某项 服务的信息与来自其他服务的信息结合起来，以便为您 提供服务、个性化内容和建议。
（3）下单
当您准备对您购物车内的商品进行结算时，耀美咖啡系 统会生成您购买该商品的订单。您需要在订单中至少填 写您的收货人姓名、收货地址以及手机号码，同时该订 单中会载明订单号、您所购买的商品或服务信息、您应 支付的货款金额及支付方式。
您在耀美咖啡上购买海外购商品、办理提现等业务时， 您还可能需要根据国家法律法规的要求提供您的实名信 息，这些实名信息可能包括您的身份信息（比如您的身 份证、军官证、护照、驾驶证等载明您身份的证件复印 件或号码）、您本人的照片或视频、姓名、电话号码、 银行账户等。这些订单中将可能包含您的行程、您指定 的服务或设备安装地址（可能是您的家庭地址）等信 息。
上述所有信息构成您的“订单信息”，我们将使用您的订 单信息来进行您的身份核验、确定交易、支付结算、完 成配送、为您查询订单以及提供客服咨询与售后服务； 我们还会使用您的订单信息来判断您的交易是否存在异 常以保护您的交易安全。
（4）支付功能
在您下单后，您可以选择耀美咖啡的关联方或与耀美咖啡合作的第三方支付机构（包括微信支付、支付宝支 付，以下称“支付机构”）所提供的支付服务。支付功能 本身并不收集您的个人信息，但我们需要将您的耀美咖啡订单号与交易金额信息与这些支付机构共享以实现其 确认您的支付指令并完成支付。“关联方”指一方现在或 将来控制、受控制或与其处于共同控制下的任何公司、 机构以及上述公司或机构的法定代表人。“控制”是指直 接或间接地拥有影响所提及公司管理的能力，无论是通 过所有权、有投票权的股份、合同或其他被人民法院认 定的方式。
（5）交付产品与／或服务功能
在当您下单并在线完成支付后，耀美咖啡的关联方或与 耀美咖啡合作的第三方配送公司（包括顺丰、圆通等， 以下称“配送公司”）将为您完成订单的交付。您知晓并 同意耀美咖啡的关联方或与耀美咖啡合作的第三方配送 公司会在上述环节内使用您的订单信息以保证您的订购 的商品能够安全送达。
（6）客服与售后功能
我们的客服和售后功能会使用您的账号信息和订单信 息。
为保证您的账号安全，我们的呼叫中心客服和在线客服 会使用您的账号信息与您核验您的身份。当您需要我们 提供与您订单信息相关的客服与售后服务时，我们将会 查询您的订单信息。您有可能会在与我们的客服人员沟 通时，提供给出上述信息外的其他信息，如当您要求我 们变更配送地址、联系人或联系电话。
2、保障交易安全所必须的功能
为提高您使用我们的产品与／或服务时系统的安全性， 更准确地预防钓鱼网站欺诈和保护账户安全，我们可能 会通过了解您的浏览信息、订单信息、您常用的软件信 息、设备信息等手段来判断您的账号风险，并可能会记 录一些我们认为有风险的链接（“URL”）；我们也会收 集您的设备信息对于耀美咖啡系统问题进行分析、统计 流量并排查可能存在的风险、在您选择向我们发送异常 信息时予以排查。
（二）您可自主选择提供的个人信息的情形
1、为使您购物更便捷或更有乐趣，从而提升您在耀美咖啡的网上购物体验，我们的以下扩展功能中可能会收 集和使用您的个人信息。如果您不提供这些个人信息， 您依然可以进行网上购物，但您可能无法使用这些可以 为您所带来购物乐趣的扩展功能或在购买某些商品时需 要重复填写一些信息。这些扩展功能包括：
（1）基于位置信息的个性化推荐功能：我们会收集您 的位置信息（我们仅收集您当时所处的地理位置，但不 会将您各时段的位置信息进行结合以判断您的行踪轨 迹）来判断您所处的地点，自动为您推荐您所在区域可 以购买的商品或服务。
（2）基于摄像头（相机）的扩展功能：您可以使用这 个扩展功能完成视频拍摄、拍照、扫码的功能。
（3）基于图片上传的扩展功能：您可以在耀美咖啡上 传您的照片来实现拍照购物功能和晒单、评价功能，我 们会使用您所上传的图片来识别您需要购买的商品或使 用包含您所上传图片的晒单、评价。
2、上述扩展功能可能需要您在您的设备中向我们开启 您的地理位置（位置信息）、相机（摄像头）、相册 （图片库）的访问权限，以实现这些功能所涉及的信息 的收集和使用。您可以在“设置”中逐项查看您上述权限 的开启状态，并可以决定将这些权限随时的开启或关 闭。请您注意，您开启这些权限即代表您授权我们可以 收集和使用这些个人信息来实现上述的功能，您关闭权 限即代表您取消了这些授权，则我们将不再继续收集和 使用您的这些个人信息，也无法为您提供上述与这些授 权所对应的功能。您关闭权限的决定不会影响此前基于 您的授权所进行的个人信息的处理。
（三）您充分知晓，以下情形中，我们收集、使用个人 信息无需征得您的授权同意：
1、与国家安全、国防安全有关的；
2、与公共安全、公共卫生、重大公共利益有关的； 3、与犯罪侦查、起诉、审判和判决执行等有关的； 4、出于维护个人信息主体或其他个人的生命、财产等 重大合法权益但又很难得到本人同意的；
5、所收集的个人信息是个人信息主体或监护人自行向 社会公众公开的；
6、从合法公开披露的信息中收集的您的个人信息的， 如合法的新闻报道、政府信息公开等渠道；
7、根据您的要求签订合同所必需的；
8、用于维护所提供的产品与／或服务的安全稳定运行所
必需的，例如发现、处置产品与／或服务的故障；
9、为合法的新闻报道所必需的；
10、学术研究机构基于公共利益开展统计或学术研究所 必要，且对外提供学术研究或描述的结果时，对结果中 所包含的个人信息进行去标识化处理的；
11、法律法规规定的其他情形。
（四）我们从第三方获得您个人信息的情形
我们可能从第三方获取您授权共享的账户信息（头像、 昵称），并在您同意本隐私政策后将您的第三方账户与 您的耀美咖啡账户绑定，使您可以通过第三方账户直接 登录并使用我们的产品与／或服务。我们会将依据与第 三方的约定、对个人信息来源的合法性进行确认后，在 符合相关法律和法规规定的前提下，使用您的这些个人 信息。
（五）您个人信息使用的规则
1、我们会根据本隐私权政策的约定并为实现我们的产 品与／或服务功能对所收集的个人信息进行使用。
2、在收集您的个人信息后，我们将通过技术手段对数 据进行去标识化处理，去标识化处理的信息将无法识别 主体。请您了解并同意，在此情况下我们有权使用已经 去标识化的信息；并在不透露您个人信息的前提下，我 们有权对用户数据库进行分析并予以商业化的利用。 3、请您注意，您在使用我们的产品与／或服务时所提供 的所有个人信息，除非您删除或通过系统设置拒绝我们 收集，否则将在您使用我们的产品与／或服务期间持续 授权我们使用。
4、我们会对我们的产品与／或服务使用情况进行统计， 并可能会与公众或第三方共享这些统计信息，以展示我 们的产品与／或服务的整体使用趋势。但这些统计信息 不包含您的任何身份识别信息。
5、当我们展示您的个人信息时，我们会采用包括内容 替换、匿名处理方式对您的信息进行脱敏，以保护您的 信息安全。
6、当我们要将您的个人信息用于本隐私权政策未载明 的其它用途时，或基于特定目的收集而来的信息用于其 他目的时，会通过您主动做出勾选的形式事先征求您的 同意。
二、我们如何使用Cookies和同类技术 （一）Cookies的使用
1、为实现您联机体验的个性化需求，使您获得更轻松 的访问体验。我们会在您的计算机或移动设备上发送一 个或多个名为Cookies的小数据文件，指定给您的
Cookies 是唯一的，它只能被将Cookies发布给您的域 中的Web服务器读取。我们向您发送Cookies是为了简 化您重复登录的步骤、存储您的购物偏好或您购物车中 的商品等数据进而为您提供购物的偏好设置、帮助您优 化对广告的选择与互动、帮助判断您的登录状态以及账 户或数据安全。
2、我们不会将Cookies用于本隐私政策所述目的之外 的任何用途。您可根据自己的偏好管理或删除
Cookies。您可以清除计算机上保存的所有Cookies， 大部分网络浏览器会自动接受Cookies，但您通常可根 据自己的需要来修改浏览器的设置以拒绝Cookies；另 外，您也可以清除软件内保存的所有Cookies。但如果 您这么做，您可能需要在每一次访问耀美咖啡网页时亲
自更改用户设置，而且您之前所记录的相应信息也均会 被删除，并且可能会对您所使用服务的安全性有一定影 响。
（二）网络Beacon和同类技术的使用
除Cookies外，我们还会在网站上使用网络Beacon等 其他同类技术。我们的网页上常会包含一些电子图像 （称为＂单像素＂GIF文件或“网络 Beacon＂）。我们使 用网络Beacon的方式有：
1、通过在耀美咖啡网页上使用网络Beacon，计算用户 访问数量，并通过访问Cookies辨认注册的耀美咖啡用 户。
12、通过得到的Cookies信息，为您提供个性化服务。 三、我们如何共享、转让、公开披露您的个人信息 （一）共享
1、我们不会与耀美咖啡以外的任何公司、组织和个人 共享您的个人信息，但以下情况除外：
（1）事先获得您明确的同意或授权；
（2）根据适用的法律法规、法律程序的要求、强制性 的行政或司法要求所必须的情况下进行提供；
（3）在法律法规允许的范围内，为维护耀美咖啡、耀美咖啡的关联方或合作伙伴、您或其他耀美咖啡用户或 社会公众利益、财产或安全免遭损害而有必要提供； （4）只有共享您的个人信息，才能实现我们的产品 与／或服务的核心功能或提供您需要的服务；
（5）应您需求为您处理您与他人的纠纷或争议；
（6）符合与您签署的相关协议（包括在线签署的电子 协议以及相应的平台规则）或其他的法律文件约定所提 供；
（7）基于学术研究而使用；
（8）基于符合法律法规的社会公共利益而使用。
2、我们可能会将您的个人信息与我们的关联方共享。 但我们只会共享必要的个人信息，且受本隐私权政策中 所声明目的的约束。我们的关联方如要改变个人信息的 处理目的，将再次征求您的授权同意。
3、我们可能会向合作伙伴等第三方共享您的订单信 息、账户信息、设备信息以及位置信息，以保障为您提 供的服务顺利完成。但我们仅会出于合法、正当、必 要、特定、明确的目的共享您的个人信息，并且只会共 享提供服务所必要的个人信息。我们的合作伙伴无权将 共享的个人信息用于任何其他用途。我们的合作伙伴包 括以下类型：
（1）商品或技术服务的供应商。我们可能会将您的个 人信息共享给支持我们功能的第三方。这些支持包括为 我们的供货或提供基础设施技术服务、物流配送服务、 支付服务、数据处理等。我们共享这些信息的目的是可 以实现我们产品与／或服务的核心购物功能，比如我们 必须与物流服务提供商共享您的订单信息才能安排送 货；或者我们需要将您的订单号和订单金额与第三方支 付机构共享以实现其确认您的支付指令并完成支付等。 （2）第三方商家。我们必须将您的订单信息与交易有 关的必要信息与第三方商家共享来实现您向其购买商品 或服务的需求，并促使其可以完成后续的售后服务。 （3）委托我们进行推广的合作伙伴。有时我们会代表 其他企业向使用我们产品与／或服务的用户群提供促销 推广的服务。我们可能会使用您的个人信息以及您的非
个人信息集合形成的间接用户画像与委托我们进行推广
的合作伙伴（“委托方”）共享，但我们仅会向这些委托 方提供推广的覆盖面和有效性的信息，而不会提供您的 个人身份信息，或者我们将这些信息进行汇总，以便它 不会识别您个人。比如我们可以告知该委托方有多少人 看了他们的推广信息或在看到这些信息后购买了委托方 的商品，或者向他们提供不能识别个人身份的统计信 息，帮助他们了解其受众或顾客。
4、对我们与之共享个人信息的公司、组织和个人，我 们会与其签署严格的保密协定，要求他们按照我们的说 明、本隐私政策以及其他任何相关的保密和安全措施来 处理个人信息。在个人敏感数据使用上，我们要求第三 方采用数据脱敏和加密技术，从而更好地保护用户数 据。
5、为了遵守法律、执行或适用我们的使用条件和其他 协议，或者为了保护耀美咖啡、您或其他耀美咖啡客户 的权利及其财产或安全，比如为防止欺诈等违法活动和 减少信用风险，而与其他公司和组织交换信息。不过， 这并不包括违反本隐私政策中所作的承诺而为获利目的 出售、出租、共享或以其它方式披露的个人信息。
（二）转让
我们不会将您的个人信息转让给任何公司、组织和个 人，但以下情况除外：
1、事先获得您明确的同意或授权；
2、根据适用的法律法规、法律程序的要求、强制性的 行政或司法要求所必须的情况进行提供；
3、符合与您签署的相关协议（包括在线签署的电子协 议以及相应的平台规则）或其他的法律文件约定所提 供；
4、在涉及合并、收购、资产转让或类似的交易时，如 涉及到个人信息转让，我们会要求新的持有您个人信息 的公司、组织继续受本隐私政策的约束，否则，我们将 要求该公司、组织重新向您征求授权同意。
（三）公开披露
我们仅会在以下情况下，且采取符合业界标准的安全防 护措施的前提下，才会公开披露您的个人信息：
1、根据您的需求，在您明确同意的披露方式下披露您 所指定的个人信息；
2、根据法律、法规的要求、强制性的行政执法或司法 要求所必须提供您个人信息的情况下，我们可能会依据 所要求的个人信息类型和披露方式公开披露您的个人信 息。在符合法律法规的前提下，当我们收到上述披露信 息的请求时，我们会要求必须出具与之相应的法律文 件，如传票或调查函。我们坚信，对于要求我们提供的 信息，应该在法律允许的范围内尽可能保持透明。我们 对所有的请求都进行了慎重的审查，以确保其具备合法 依据，且仅限于执法部门因特定调查目的且有合法权利 获取的数据。在法律法规许可的前提下，我们披露的文 件均在加密密钥的保护之下。
四、我们如何保护和保存您的个人信息 （一）我们保护您个人信息的技术与措施
我们非常重视个人信息安全，并采取一切合理可行的措 施，保护您的个人信息：
1、数据安全技术措施
我们会采用符合业界标准的安全防护措施，包括建立合 理的制度规范、安全技术来防止您的个人信息遭到未经 授权的访问使用、修改，避免数据的损坏或丢失。
我们会采用符合业界标准的安全防护措施，包括建立合 理的制度规范、安全技术来防止您的个人信息遭到未经 授权的访问使用、修改，避免数据的损坏或丢失。耀美咖啡的网络服务采取了传输层安全协议等加密技术，通 过https等方式提供浏览服务，确保用户数据在传输过 程中的安全。
我们会采用符合业界标准的安全防护措施，包括建立合 理的制度规范、安全技术来防止您的个人信息遭到未经 授权的访问使用、修改，避免数据的损坏或丢失。耀美咖啡采取加密技术对用户个人信息进行加密保存，并通 过隔离技术进行隔离。
我们会采用符合业界标准的安全防护措施，包括建立合 理的制度规范、安全技术来防止您的个人信息遭到未经 授权的访问使用、修改，避免数据的损坏或丢失。在个 人信息使用时，例如个人信息展示、个人信息关联计 算，我们会采用包括内容替换、SHA256在内多种数据 脱敏技术增强个人信息在使用中安全性。
我们会采用符合业界标准的安全防护措施，包括建立合 理的制度规范、安全技术来防止您的个人信息遭到未经 授权的访问使用、修改，避免数据的损坏或丢失。耀美咖啡采用严格的数据访问权限控制和多重身份认证技术 保护个人信息，避免数据被违规使用。
我们会采用符合业界标准的安全防护措施，包括建立合 理的制度规范、安全技术来防止您的个人信息遭到未经 授权的访问使用、修改，避免数据的损坏或丢失。耀美咖啡采用代码安全自动检查、数据访问日志分析技术进 行个人信息安全审计。
2、耀美咖啡为保护个人信息采取的其他安全措施
耀美咖啡通过建立数据分类分级制度、数据安全管理规 范、数据安全开发规范来管理规范个人信息的存储和使 用。
耀美咖啡通过信息接触者保密协议、监控和审计机制来 对数据进行全面安全控制。
耀美咖啡建立数据安全委员会并下设信息保护专职部 门、数据安全应急响应组织来推进和保障个人信息安 全。
安全认证和服务。我们存储您个人信息的底层云技术采 取了多级多维度的安全认证措施和技术方案。
加强安全意识。我们还会举办安全和隐私保护培训课 程，加强员工对于保护个人信息重要性的认识。
3、我们仅允许有必要知晓这些信息的耀美咖啡及耀美咖啡关联方的员工、合作伙伴访问个人信息，并为此设 置了严格的访问权限控制和监控机制。我们同时要求可 能接触到您个人信息的所有人员履行相应的保密义务。 如果未能履行这些义务，可能会被追究法律责任或被中 止与耀美咖啡的合作关系。
4、我们会采取一切合理可行的措施，确保未收集无关 的个人信息。我们只会在达成本隐私权政策所述目的所 需的期限内保留您的个人信息，除非需要延长保留期或 受到法律的允许。
5、互联网并非绝对安全的环境，而且电子邮件、即时 通讯、社交软件等与其他用户的交流方式无法确定是否 完全加密，我们建议您使用此类工具时请使用复杂密 码，并注意保护您的个人信息安全。
6、互联网环境并非百分之百安全，我们将尽力确保或
担保您发送给我们的任何信息的安全性。如果我们的物
理、技术、或管理防护设施遭到破坏，导致信息被非授 权访问、公开披露、篡改、或毁坏，导致您的合法权益 受损，我们将承担相应的法律责任。
7、安全事件处置
在通过耀美咖啡与第三方进行网上商品或服务的交易 时，您不可避免的要向交易对方或潜在的交易对方披露 自己的个人信息，如联络方式或者邮政地址等。请您妥 善保护自己的个人信息，仅在必要的情形下向他人提 供。
为应对个人信息泄露、损毁和丢失等可能出现的风险， 耀美咖啡制定了多项制度，明确安全事件、安全漏洞的 分类分级标准及相应的处理流程。耀美咖啡也为安全事 件建立了专门的应急响应团队，按照安全事件处置规范 要求，针对不同安全事件启动安全预案，进行止损、分 析、定位、制定补救措施、联合相关部门进行溯源和打 击。
在不幸发生个人信息安全事件后，我们将按照法律法规 的要求，及时向您告知：安全事件的基本情况和可能的 影响、我们已采取或将要采取的处置措施、您可自主防 范和降低风险的建议、对您的补救措施等。我们同时将 及时将事件相关情况以邮件、信函、电话、推送通知等 方式告知您，难以逐一告知个人信息主体时，我们会采 取合理、有效的方式发布公告。同时，我们还将按照监 管部门要求，主动上报个人信息安全事件的处置情况。 8、如果您对我们的个人信息保护有任何疑问，可通过 本隐私权政策中约定的联系方式联系我们。如您发现自 己的个人信息泄密，尤其是您的账户及密码发生泄露， 请您立即联络我们，以便我们采取相应措施。
（二）您个人信息的保存
1、您的个人信息将存储于中华人民共和国境内。如您 使用跨境交易服务，且需要向境外传输您的个人信息完 成交易的，我们会单独征得您的授权同意并要求接收方 按照我们的说明、本隐私权政策以及其他任何相关的保 密和安全措施来处理这些个人信息。
2、如果我们终止服务或运营，我们会至少提前三十日 向您通知，并在终止服务或运营后对您的个人信息进行 删除或匿名化处理。
五、您如何管理您的个人信息
耀美咖啡非常重视您对个人信息的关注，并尽全力保护 您对于您个人信息访问、更正、删除以及撤回同意的权 利，以使您拥有充分的能力保障您的隐私和安全。您的 权利包括：
1、访问和更正您的个人信息
除法律法规规定外，您有权随时访问和更正您的个人信 息，具体包括：
（1）您的账户信息：您可以在APP／程序等各官方平台 “我的—设置”中查阅您提交给耀美咖啡的所有个人信 息，你也可通过上述途径更新除实名认证信息之外的其 他个人信息（您的实名认证信息是您通过实名认证时使 用的姓名和身份证信息）。
（2）您的收货信息：您可以在APP／程序等各官方平台 “我的—设置—地址管理”中进行收货信息设置。您也可 以将最常用的收货地址设置为默认地址，如此您下次购 买商品时在您未更改收货地址时，您的商品会配送到您 默认地址。
（3）您的订单信息：您可以在APP／程序等各官方平台 “我的—我的订单”中对“待付款／待发货／待收货／待评 价／退换售后”订单进行操作。
（4）对于您在使用我们的产品与／或服务过程中产生的 其他个人信息需要访问或更正，请随时联系我们。
（5）您无法访问和更正的个人信息：除上述列明的信 息外，您的部分个人信息我们还无法为您提供访问和更 正的服务，这些信息主要是为了提升您的用户体验和保 证交易安全所收集的您的设备信息、您使用扩展功能时 产生的个人信息。上述信息我们会在您的授权范围内进 行使用，您无法访问和更正，但您可联系我们进行删除 或做匿名化处理。
2、删除您的个人信息
您在我们的产品与／或服务页面中可以直接清除或删除 的信息，包括订单信息、浏览信息、收货地址信息； 在以下情形中，您可以向我们提出删除个人信息的请 求：
（1）如果我们处理个人信息的行为违反法律法规； （2）如果我们收集、使用您的个人信息，却未征得您 的同意；
（3）如果我们处理个人信息的行为违反了与您的约 定；
（4）如果我们终止服务及运营。
若我们决定响应您的删除请求，我们还将同时通知从我 们获得您的个人信息的实体，要求其及时删除，除非法 律法规另有规定，或这些实体获得您的独立授权。若我 们响应您的删除请求，我们不能保证立即从备份系统中 删除相应的信息，但会在备份系统更新时删除这些信 息。
3、改变您授权同意的范围或撤回您的授权
您可以通过删除信息、关闭设备功能、在耀美咖啡官方 平台中进行隐私设置等方式改变您授权我们继续收集个 人信息的范围或撤回您的授权。
请您理解，每个业务功能需要一些基本的个人信息才能 得以完成，当您撤回同意或授权后，我们无法继续为您 提供撤回同意或授权所对应的服务，也不再处理您相应 的个人信息。但您撤回同意或授权的决定，不会影响此 前基于您的授权而开展的个人信息处理。
4、响应您的请求
如果您无法通过上述方式访问、更正或删除您的个人信 息，或您需要访问、更正或删除您在使用我们产品与／ 或服务时所产生的其他个人信息，或您认为耀美咖啡存 在任何违反法律法规或与您关于个人信息的收集或使用 的约定，您均可以与我们联系。为了保障安全，我们可 能需要您提供书面请求，或提供您的身份证明文件，我 们将在收到您反馈并验证您的身份后的15天内答复您的 请求。对于您合理的请求，我们原则上不收取费用，但 对多次重复、超出合理限度的请求，我们将视情收取一 定成本费用。对于那些无端重复、需要过多技术手段 （例如，需要开发新系统或从根本上改变现行惯例）、 给他人合法权益带来风险或者非常不切实际（例如，涉 及备份磁带上存放的信息）的请求，我们可能会予以拒 绝。
在以下情形中，按照法律法规要求，我们将无法响应您 的请求：
（1）与国家安全、国防安全有关的；
（2）与公共安全、公共卫生、重大公共利益有关的； （3）与犯罪侦查、起诉和审判等有关的；
（4）有充分证据表明您存在主观恶意或滥用权利的； （5）响应您的请求将导致您或其他个人、组织的合法 权益受到严重损害的。
六、未成年人的个人信息保护
1、耀美咖啡非常重视对未成年人个人信息的保护。若 您是18周岁以下的未成年人，在使用我们的产品与／或 服务前，应事先取得您监护人的同意。耀美咖啡根据国 家相关法律法规的规定保护未成年人的个人信息。
2、我们不会主动直接向未成年人收集其个人信息。对 于经监护人同意而收集未成年人个人信息的情况，我们 只会在受到法律允许、监护人同意或者保护未成年人所 必要的情况下使用、共享、转让或披露此信息。
3、如果有事实证明未成年人并未取得监护人同意的情 况下注册使用了我们的产品与／或服务，我们会与相关 监护人协商，并设法尽快删除相关个人信息。
4、对于可能涉及的不满14周岁的儿童个人信息，我们 进一步采取以下措施予以保障：
（1）对于收集到的儿童个人信息，我们除遵守本隐私 权政策关于用户个人信息的约定外，还会秉持正当必 要、知情同意、目的明确、安全保障、依法利用的原 则，严格遵循《儿童个人信息网络保护规定》等法律法 规的要求进行存储、使用、披露，且不会超过实现收 集、使用目的所必须的期限，到期后我们会对儿童个人 信息进行删除或匿名化处理。
（2）当您作为监护人为被监护的儿童选择使用耀美咖啡相关服务时，我们可能需要向您收集被监护的儿童个 人信息，用于向您履行相关服务之必要。在具体服务中 需要向您收集儿童个人信息的，我们会事先取得您的授 权同意，并告知您收集的目的和用途。如果您不提供前 述信息，您将无法享受我们提供的相关服务。此外，您 在使用晒单、评价功能分享商品相关信息时可能会主动 向我们提供儿童个人信息，请您明确知悉并谨慎选择。 您作为监护人应当正确履行监护职责，保护儿童个人信 息安全。若儿童本人需要注册或使用我们的产品与／或 服务，您应正确引导并予以监护。
（3）儿童或其监护人有权随时访问和更正儿童个人信 息，还可以向我们提出更正和删除的请求。如您对儿童 个人信息相关事宜有任何意见、建议或投诉、举报，请 联系我们。我们会随时为您提供帮助。
七、通知和修订
1、为给您提供更好的服务以及随着耀美咖啡业务的发 展，本隐私权政策也会随之更新。但未经您明确同意， 我们不会削减您依据本隐私权政策所应享有的权利。我 们会通过在耀美咖啡网页、耀美咖啡移动端上发出更新 版本并在生效前通过公告或以其他适当方式提醒您相关 内容的更新，也请您访问耀美咖啡以便及时了解最新的 隐私权政策。
2、对于重大变更，我们还会提供更为显著的通知（我 们会通过包括但不限于短信或在浏览页面做特别提示等 方式，说明隐私权政策的具体变更内容）。
本隐私权政策所指的重大变更包括但不限于：
（1）我们的服务模式发生重大变化。如处理个人信息 的目的、处理的个人信息类型、个人信息的使用方式
等；
（2）我们在所有权结构、组织架构等方面发生重大变 化。如业务调整、破产并购等引起的所有者变更等； （3）个人信息共享、转让或公开披露的主要对象发生 变化；
（4）您参与个人信息处理方面的权利及其行使方式发 生重大变化；
（5）我们负责处理个人信息安全的责任部门、联络方 式及投诉渠道发生变化时；
（6）个人信息安全影响评估报告表明存在高风险时。 八、如何联系我们
1、如您对本隐私权政策或您个人信息的相关事宜有任 何问题、意见或建议，请联系耀美咖啡。您可以随时通过访问APP／小程序在线客服等多种方式与 我们联系。
2、一般情况下，我们将在15天内回复。如果您对我们 的回复不满意，特别是我们的个人信息处理行为损害了 您的合法权益，您还可以向网信、电信、公安及工商等 监管部门进行投诉或举报。

      `
      }}
    </div>
  </view>
</template>

<script setup lang="ts"></script>

<style lang="scss">
.privacy-protocol {
  width: 100%;
  white-space: pre-wrap;

  .title {
    width: 100%;
    text-align: center;
  }
  .content {
    white-space: pre-wrap;
  }
}
</style>
